Revit 2027 API
UnitTypeId.MeganewtonMeters Property
 Meganewton meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MeganewtonMeters { get; }
Public Shared ReadOnly Property MeganewtonMeters As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MeganewtonMeters {
	ForgeTypeId^ get ();
}
static member MeganewtonMeters : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace